---
kind: type
id: T:Autodesk.Revit.DB.KeynoteEntries
source: html/1463acbb-85c7-e0a8-81fd-c82360db72ef.htm
---
# Autodesk.Revit.DB.KeynoteEntries

A collection of KeynoteEntry objects that make up the keynote table.

## Syntax (C#)
```csharp
public class KeynoteEntries : KeyBasedTreeEntries
```